export const textJson = [
  {
    type: 'text',
    value: [
      `Благодаря глаголам, мы узнаем, что происходит. Благодаря модальным глаголам, мы показываем наше отношение. «Я плаваю» — не то же самое,
    что «я умею/могу плавать», «мне следует плавать». Модальные глаголы в китайском языке почти никогда не объединяются с существительными.
    Появляясь в предложении, они притягивают на себя все внимание и даже становятся сильнее грамматически, чем все остальные члены
    предложения. Так, например, модальные глаголы не удваиваются, не могут употребляться с`,
      {
        type: 'hieroglyph',
        variant: 'inline',
        value: {
          view: 0,
          p: 'le',
          t: 'понимать',
          h: '了',
        },
      },
    ],
  },
  {
    type: 'example',
    value: [
      {
        type: 'hieroglyph',
        variant: 'newline',
        value: {
          p: 'nǐ xiǎng bù xiǎng kàn diànyǐng',
          t: 'Не хочешь посмотреть фильм?',
          h: '你想不想看电影',
        },
      },
      {
        type: 'hieroglyph',
        variant: 'newline',
        value: {
          p: 'zhèér kěbùkěyǐ chōuyān',
          t: 'Можно ли здесь курить?',
          h: '这儿可不可以抽烟',
        },
      },
    ],
  },
  {
    type: 'hint',
    variant: 'warn',
    value: [
      'Не путайте с глаголом «думать, хотеть, скучать»:',
      {
        type: 'hieroglyph',
        variant: 'newline',
        value: {
          p: 'wǒ xiǎng huíjiā',
          t: 'Я хочу вернуться домой',
          h: '我想回家',
        },
      },
      {
        type: 'hieroglyph',
        variant: 'inline',
        value: {
          p: 'xiǎng',
          t: 'модальный глагол, после него стоит глагол',
          h: '想',
        },
      },
    ],
  },
]
