<script lang="ts" setup>
</script>

<template>
  <div class="hsk-about">
    <section>
      <p>
        Уровень знания китайского языка для лиц, не являющихся носителями китайского языка, определяется квалификационным экзаменом. Его результаты признаются во всем мире.
      </p>

      <p>
        Разработаны стандарты HSK Пекинским университетом языка и культуры. Они начали применяться впервые в 1992 году. Изначально существовало всего 6 уровней (HSK-1, HSK-2, HSK-3, HSK-4, HSK-5, HSK-6).
      </p>

      <p>
        В 2021 вступил в силу новый стандарт HSK 3.0, который заменил предыдущую шестиуровневую модель. Он имеет более структурированную систему классификации. Теперь выделяются 9 уровней знания языка (HSK-1, HSK-2, HSK-3, HSK-4, HSK-5, HSK-6, HSK-7, HSK-8, HSK-9).
      </p>

      <p>
        Новый HSK соответствует другим международным стандартам, таким как CEFR (Общеевропейская система языкового обучения) и ACTFL (Американский совет по преподаванию иностранных языков). Помимо аудирования, чтения и письма, проверяются такие навыки, как разговорная речь, рукописный ввод китайских иероглифов и перевод.
      </p>

      <p>
        HSK 3.0 в своих тестах оценивает владение четырьмя основными элементами китайского языка. Это:
      </p>

      <ul>
        <li>иероглифы,</li>
        <li>активный словарный запас,</li>
        <li>грамматика,</li>
        <li>восприятие речи на слух.</li>
      </ul>

      <p>
        Если сравнивать сложность и количество слов, необходимых для прохождения всех четырехмерных тестов (восприятие речи на слух, иероглифы, словарный запас и грамматика), то можно сказать, что новый HSK более строгий, чем старый.
      </p>

      <p>
        Добавленные продвинутые уровни с 7 по 9 в новом HSK, предназначен для тех, кто изучает китайский язык, литературу, историю и культуру Китая.
      </p>
    </section>

    <section>
      <h2>Уровни владения китайским языком</h2>

      <p>Существует три основных группы владения китайским: начальный, средний и продвинутый</p>

      <p>Все 9 уровней по системе оценки HSK можно условно объединить в 3 укрупненные группы: начальный, средний и продвинутый уровни.</p>

      <div class="table-container">
        <table>
          <thead>
            <tr>
              <th>Уровень HSK</th>
              <th>Группа</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td data-label="Уровень HSK">
                HSK-1, HSK-2, HSK-3
              </td>
              <td data-label="Группа">
                Начальный
              </td>
            </tr>
            <tr>
              <td data-label="Уровень HSK">
                HSK-4, HSK-5, HSK-6
              </td>
              <td data-label="Группа">
                Средний
              </td>
            </tr>
            <tr>
              <td data-label="Уровень HSK">
                HSK-7, HSK-8, HSK-9
              </td>
              <td data-label="Группа">
                Продвинутый
              </td>
            </tr>
          </tbody>
        </table>
      </div>
    </section>

    <section>
      <h2>Критерии оценки уровней знания китайского языка</h2>
      <div class="table-container">
        <table>
          <thead>
            <tr>
              <th>Уровень</th>
              <th>Иероглифы</th>
              <th>Количество слов</th>
              <th>Грамматические конструкции</th>
            </tr>
          </thead>
          <tbody>
            <tr>
              <td data-label="Уровень">
                HSK 1
              </td>
              <td data-label="Иероглифы">
                300
              </td>
              <td data-label="Количество слов">
                500
              </td>
              <td data-label="Грамматические конструкции">
                48
              </td>
            </tr>
            <tr>
              <td data-label="Уровень">
                HSK 2
              </td>
              <td data-label="Иероглифы">
                600
              </td>
              <td data-label="Количество слов">
                1272
              </td>
              <td data-label="Грамматические конструкции">
                129
              </td>
            </tr>
            <tr>
              <td data-label="Уровень">
                HSK 3
              </td>
              <td data-label="Иероглифы">
                900
              </td>
              <td data-label="Количество слов">
                2245
              </td>
              <td data-label="Грамматические конструкции">
                210
              </td>
            </tr>
            <tr>
              <td data-label="Уровень">
                HSK 4
              </td>
              <td data-label="Иероглифы">
                1200
              </td>
              <td data-label="Количество слов">
                3245
              </td>
              <td data-label="Грамматические конструкции">
                286
              </td>
            </tr>
            <tr>
              <td data-label="Уровень">
                HSK 5
              </td>
              <td data-label="Иероглифы">
                1500
              </td>
              <td data-label="Количество слов">
                4316
              </td>
              <td data-label="Грамматические конструкции">
                357
              </td>
            </tr>
            <tr>
              <td data-label="Уровень">
                HSK 6
              </td>
              <td data-label="Иероглифы">
                1800
              </td>
              <td data-label="Количество слов">
                5456
              </td>
              <td data-label="Грамматические конструкции">
                424
              </td>
            </tr>
            <tr>
              <td data-label="Уровень">
                HSK 7, 8 и 9
              </td>
              <td data-label="Иероглифы">
                3000
              </td>
              <td data-label="Количество слов">
                11092
              </td>
              <td data-label="Грамматические конструкции">
                572
              </td>
            </tr>
          </tbody>
        </table>
      </div>
    </section>

    <section>
      <h2>Описание уровней</h2>

      <h3>Уровень HSK 1 — первоначальное знакомство с китайским языком, начальный уровень</h3>
      <p>Самый первый уровень, на котором студент узнает основы китайского языка, овладевает базовыми разговорными фразами. Общий словарный запас на данном этапе составляет 500 слов. На этом уровне студент имеет базовые знания по грамматике, понимает самые простые слова и фразы, которых достаточно для элементарной коммуникации, умеет писать и читать изученные иероглифы.</p>

      <h3>Уровень HSK 2 — начальный уровень</h3>
      <p>Это второй уровень владения, на котором студент имеет базовые знания по грамматике, умеет поддержать беседу на бытовые темы с помощью наиболее часто употребляемых фраз. На данном уровне студенту известно 1272 слова, каждое из которых он может записать иероглифами и прочитать в тексте.</p>

      <h3>Уровень HSK 3 — начальный уровень</h3>
      <p>Владение китайским языком на данном уровне предполагает возможность выполнения основных коммуникативных задач в бытовой сфере, учебе, работе, во время путешествий по Китаю. Студент с уровнем HSK 3 способен поддержать общение на несложные темы с помощью фраз и слов, наиболее часто используемых в повседневной жизни и профессиональной деятельности. На данном уровне студенту известно 2245 слов, каждое из которых он может записать иероглифами и прочитать в тексте.</p>

      <h3>Уровень HSK 4 — средний уровень</h3>
      <p>Предполагает возможность вести беседы на все распространенные темы в самых разных бытовых и профессиональных сферах. Человек способен свободно общаться с носителями китайского языка на разные темы. Общий словарный запас на четвертом уровне составляет 3245 слов.</p>

      <h3>Уровень HSK 5 — средний уровень</h3>
      <p>Пятый уровень владения китайским языком, на котором студент умеет читать газетные и журнальные статьи, понимает телепередачи и фильмы на путунхуа.</p>
      <p>Владение китайским языком на данном уровне предполагает способность студента выступать с речью перед аудиторией на китайском языке. Общий словарный запас на пятом уровне составляет 4316 слов. Уровня HSK 5 в большинстве случаев достаточно для поступления в китайские вузы.</p>

      <h3>Уровень HSK 6 — средний уровень</h3>
      <p>На 6 уровне студент владеет китайским языком не хуже, чем рядовой носитель. Он способен с легкостью воспринимать устную и письменную речь на китайском языке, свободно и развернуто выражает свои мысли как в устной, так и в письменной форме.</p>
      <p>Общий словарный запас на четвертом уровне составляет 5456 слов. Уровень HSK6 открывает двери во все учебные заведения Китая. В предыдущей версии HSK данный уровень считался продвинутым и был последним в классификации.</p>

      <h3>Уровни 7–9 – продвинутые уровни</h3>
      <p>Добавленные в версии 3.0 продвинутые уровни с 7 по 9 в новом HSK, предназначены для тех, кто специализируется на изучении китайского языка, литературы, истории и культуры Китая. Если вы хотите получить степень магистра или доктора по китайскому языку, эти уровни для вас.</p>
    </section>
  </div>
</template>

<style lang="scss" scoped>
.hsk-about {
  display: flex;
  flex-direction: column;
  gap: 16px;
  color: var(--fg-primary-color);
  font-size: 1rem;

  @include mobile() {
    font-size: 0.9rem;
  }

  p {
    padding: 8px 0;
  }

  .table-wrapper {
    overflow-x: auto;
  }

  table {
    border-collapse: collapse;
    width: 100%;
    margin: 8px 0;
  }

  th,
  td {
    border: 1px solid var(--border-secondary-color);
    padding: 8px;
    text-align: left;
  }

  th {
    background-color: var(--bg-secondary-color);
  }

  .table-container {
    overflow-x: auto;
  }

  @include mobile() {
    table {
      display: block;
    }

    thead {
      display: none;
    }

    tbody {
      display: block;
    }

    tr {
      display: block;
      margin-bottom: 16px;
      border: 1px solid var(--border-secondary-color);
    }

    td {
      display: block;
      border: none;
      padding-left: 50%;
      position: relative;
      text-align: left;
      word-break: break-word;
      text-align: right;

      &:before {
        position: absolute;
        top: 8px;
        left: 8px;
        width: 45%;
        padding-right: 10px;
        white-space: nowrap;
        font-weight: bold;
        content: attr(data-label);
        text-align: left;
      }
    }
  }

  h3 {
    margin-top: 24px;
  }
}
</style>
